Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: Kobe Bryant became an NBA veteran due to his never-give-up spirit, tough competition and accuracy.
hi: कभी हार न मानने के जज्बे, कड़ी प्रतिस्पर्धा और सटीकता के कारण कोबे ब्रायंट एनबीए के दिग्गज बने।

source: Many people start their day with a cup of coffee.
hi: कई लोग अपने दिन की शुरुआत कॉफी के एक कप के साथ करते हैं।

source: Tom showed Mary the book he authored.
hi: टॉम ने मैरी को अपनी लिखी हुई पुस्तक दिखाई।

source: Ziri took Rima's umbrella.
hi: ज़िरी ने रिमा का छाता लिया।

source: Pandit Raghunath Murmu has founded the Ol Chiki script.
hi: पंडित रघुनाथ मुर्मू ने ओल चिकी लिपि की स्थापना की है।

source: Visit the market only when necessary.
hi: बाज़ार आवश्यक होने पर ही जाएं।

source: I was born and brought up in Boston.
hi: मेरा जन्म और पालन-पोषण बोस्टन में हुआ ।

source: Well, what're you waiting for?
hi: खैर, आप किसका इंतज़ार कर रहे हैं?

source: You don't look too confident.
hi: आप बहुत आत्मविश्वासी नहीं लग रहे हैं।

source: What are you making, sir?
hi: भाईसाहब, आप क्या बना रहे हो?

source: The cat is sleeping with the girl.
hi: बिल्ला लड़की के साथ सो रहा है।

source: I live in this neighbourhood.
hi: मैं इस मोहल्ले में रहता हूँ।

source: Don't rush into marriage.
hi: शादी में जल्दबाजी न करें।

source: I will buy a new car.
hi: मैं एक नई कार ख़रीदूंगा।

source: He is waking up.
hi: वे जाग रहे हैं।

source: Which city are you from? - I'm from Rome.
hi: तुम किस शहर के हो? - मैं रोम का हूँ।

source: Pandit Raghunath Murmu developed the Ol Chiki script.
hi: पंडित रघुनाथ मुर्मू ने ओल चिकी लिपि विकसित की।

source: Algerians will defend their country.
hi: अल्जेरियाई लोग अपने देश की रक्षा करेंगे।

source: We aren't interested in such things.
hi: हें ऐसी चीज़ों में दिलचस्पी नहीं है।

source: I like all animals, except cats.
hi: मुझे बिल्लियों के अलावा सभी जानवर अच्छे लगते हैं।

source: Ziri told his dog to sit.
hi: ज़िरी ने अपने कुत्ते को बैठने के लिये कहा।

source: The king lives in the castle.
hi: राजा महल में रहता है।

source: I count.
hi: मैं गिनता हूँ।

source: Tom is going to change.
hi: टॉम बदलने वाला है।

source: Rima said she had a fight with her boyfriend.
hi: रीमा ने कहा कि उसका उसके बॉयफ्रेंड से झगड़ा हुआ था।

source: I'd like to join the club.
hi: मैं क्लब जॉइन करना चाहूंगा।

source: Bitcoin is just money.
hi: बिटकॉइन निष्पक्ष पैसा है।

source: Not Your Keys, Not Your Coins.
hi: आपकी चाबी नहीं, आपके सिक्के नहीं।

source: Bitcoin is divisible by 100 million. 1 part is called satoshi.
hi: एक बिटकॉइन के दास करोड़ भाग हैं। एक भाग को सतोशी कहते हैं।

source: It's hard to concentrate when you're tired.
hi: थके हुए हो तो ध्यान देना मुश्किल होता है।

source: I take white wine.
hi: मैं सफेद शराब लेता हूं।

source: That seems like it.
hi: ऐसा लगता है।

source: The moment that I met Tom, I just knew that we'd get along.
hi: जिस क्षण मैं टॉम से मिला, मुझे बस इतना पता था कि हम साथ रहेंगे।

source: Tom most probably forgot.
hi: टॉम शायद भूल गया।

source: I had to give it back to Tom.
hi: मुझे इसे टॉम को वापस देना था।

source: I had to return it to Tom.
hi: मुझे इसे टॉम को वापस करना पड़ा।

source: Tom stood there, saying nothing.
hi: टॉम वहीं खड़ा रहा, कुछ नहीं बोला।

source: The last time I saw Tom he was heading towards the beach.
hi: आखिरी बार जब मैंने टॉम को देखा तो वह समुद्र तट की ओर जा रहा था।

source: Tom promised he would change.
hi: टॉम ने वादा किया कि वह बदल जाएगा।

source: Tom asked me to bring him some food.
hi: टॉम ने मुझे उसके लिए कुछ खाना लाने को कहा।

source: Tom is going there.
hi: टॉम वहाँ जा रहा है।

source: The children don't want to play with Tom.
hi: बच्चे टॉम के साथ नहीं खेलना चाहते।

source: Tom has already been forgiven.
hi: टॉम को पहले ही माफ कर दिया गया है।

source: Tom isn't watching TV. He is reading a book.
hi: टॉम टीवी नहीं देख रहा है। वह एक किताब पढ़ रहा है।

source: Tom is organizing this event.
hi: टॉम इस इवेंट का आयोजन कर रहे हैं।

source: I bet Tom was happy.
hi: मुझे यकीन है कि टॉम खुश था।

source: Do you know anybody who could help Tom?
hi: क्या आप किसी ऐसे व्यक्ति को जानते हैं जो टॉम की मदद कर सकता है?

source: Tom forced himself to get up early.
hi: टॉम ने खुद को जल्दी उठने के लिए मजबूर किया।

source: Tom is a first-rate scientist.
hi: टॉम प्रथम श्रेणी के वैज्ञानिक हैं।

source: For a while now, Tom has been thinking about emigrating.
hi: कुछ समय के लिए, टॉम उत्प्रवास के बारे में सोच रहा है।

source: Tom has been thinking about emigrating for a while now.
hi: टॉम कुछ समय से विदेश जाने के बारे में सोच रहा है।

source: Tom is sorely lacking in empathy.
hi: टॉम में सहानुभूति की कमी है।

source: Tom looked at me as if I were mad.
hi: टॉम ने मुझे ऐसे देखा जैसे मैं पागल हो गया हूं।

source: Mary threw the ring in Tom's face.
hi: मैरी ने टॉम के चेहरे पर अंगूठी फेंक दी।

source: Tom is making boiled eggs.
hi: टॉम उबले अंडे बना रहा है।

source: It could've killed Tom.
hi: यह टॉम को मार सकता था।

source: Tom can't take a hint. You really have to spell it out to him.
hi: टॉम कोई संकेत नहीं ले सकता। आपको वास्तव में उसे इसका जादू करना होगा।

source: Tom lived a year on the street, scrounging for food.
hi: टॉम एक साल सड़क पर रहा, भोजन के लिए छटपटाता रहा।

source: Thanks to your recommendation, Tom got that job.
hi: आपकी सिफारिश के लिए धन्यवाद, टॉम को वह नौकरी मिल गई।

source: Tom forgot his coat downstairs.
hi: टॉम अपना कोट नीचे भूल गया।

source: Tom spends most of his time helping Mary.
hi: टॉम अपना ज्यादातर समय मैरी की मदद करने में बिताता है।

source: Tom speaks bad French.
hi: टॉम खराब फ्रेंच बोलता है।

source: Isn't Tom in your class?
hi: क्या टॉम आपकी कक्षा में नहीं है?

source: Tom lives with his friends.
hi: टॉम अपने दोस्तों के साथ रहता है।

source: Tom loves women.
hi: टॉम महिलाओं से प्यार करता है।

source: People love Tom.
hi: लोग टॉम को प्यार करते हैं।

source: I couldn't tell what Tom wanted.
hi: मैं नहीं बता सकता था कि टॉम क्या चाहता है।

source: Tom couldn't tell where he was.
hi: टॉम नहीं बता सकता था कि वह कहाँ था।

source: Tom couldn't figure out where he was.
hi: टॉम समझ नहीं पा रहा था कि वह कहाँ है।

source: I bought Tom a coffee.
hi: मैंने टॉम के लिए एक कॉफी खरीदी।

source: Tom didn't arrive at work.
hi: टॉम काम पर नहीं आया।

source: Tom marked the route on the map.
hi: टॉम ने मानचित्र पर मार्ग को चिह्नित किया।

source: They refused to obey Tom's orders.
hi: उन्होंने टॉम का आदेश मानने से इंकार कर दिया।

source: Tom doesn't want to do exercise.
hi: टॉम व्यायाम नहीं करना चाहता।

source: This song reminds me of Tom.
hi: यह गाना मुझे टॉम की याद दिलाता है।

source: I have no need to lie to Tom.
hi: मुझे टॉम से झूठ बोलने की कोई जरूरत नहीं है।

source: If Tom goes, so will I.
hi: अगर टॉम जाएगा, तो मैं भी जाऊंगा।

source: Tom looked through the peephole, but didn't see anyone.
hi: टॉम ने झाँक कर देखा, लेकिन किसी को नहीं देखा।

source: Pick Tom.
hi: टॉम उठाओ।

source: That wouldn't be fair to Tom.
hi: यह टॉम के लिए उचित नहीं होगा।

source: Tom tried but he failed.
hi: टॉम ने कोशिश की लेकिन वह असफल रहा।

source: I made a new friend today.
hi: आज मैंने एक नया दोस्त बनाया।

source: Tom is still shopping.
hi: टॉम अभी भी खरीदारी कर रहा है।

source: Tom claimed responsibility.
hi: टॉम ने जिम्मेदारी का दावा किया।

source: Tom busted out of prison.
hi: टॉम जेल से छूट गया।

source: Tom is looking for a place to lay low.
hi: टॉम नीचे लेटने के लिए जगह ढूंढ रहा है।

source: Tom is a master manipulator.
hi: टॉम एक मास्टर मैनिपुलेटर है।

source: Tom's wedding is in October.
hi: टॉम की शादी अक्टूबर में है।

source: What time do you go to sleep?
hi: तुम कितनी बजे सोते हो?

source: This restaurant's too expensive.
hi: यह रेस्टोरेंट काफ़ी महंगा है।

source: Some crimes have no statute of limitations.
hi: कुछ अपराधों की कोई सीमा नहीं होती है।

source: I've read three books since last Monday.
hi: मैंने पिछले सोमवार से तीन किताबें पढ़ी हैं।

source: We've got to talk to Tom.
hi: हमें टॉम से बात करनी होगी।

source: I should speak with Tom.
hi: मुझे टॉम से बात करनी चाहिए।

source: It didn't rain today.
hi: आज बारिश नहीं हुई।

source: No one else would've understood this.
hi: कोई और ये नहीं समझता।

source: I like old things.
hi: मुझे पुरानी चीज़ें पसंद हैं।

source: Tom won't be home for Christmas this year.
hi: टॉम इस साल क्रिसमस पर घर नहीं आएगा।

source: Nothing is better than ice cream in the summer.
hi: गर्मी में आइसक्रीम से बेहतर कुछ नहीं।

source: Tom is Mary's husband's older brother.
hi: टॉम मैरी का जेठ है।

source: I've injured my foot.
hi: मेरे पैर पर चोंट लगी है।

source: Tom didn't know what to do so he didn't do anything.
hi: टॉम को पता नहीं था करना क्या है तो उसने कुछ नहीं किया।

source: I told Tom what he should do, but he didn't do it.
hi: मैंने टॉम को बताया उसे क्या करना चाहिए पर उसने वैसा नहीं किया।

source: Have you done anything yet?
hi: अभी तक तुमने कुछ किया?

source: What were you doing before Tom got here?
hi: टॉम के आने से पहले तुम क्या कर रहे थे?

source: What have you been doing the past three hours?
hi: पिछले तीन घंटों से क्या कर रहे हो तुम?

source: I'll come pick it up next Monday.
hi: मैं अगले सोमवार आके ले जाऊंगा।

source: Do you watch the news?
hi: क्या आप समाचार देखते हैं?
